betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_hash.c
    [..]
    Additionally, this subsection provides functions allowing to save and restore
    the HASH or HMAC processing context in case of calculation suspension:
      (+) DAL_HASH_ContextSaving()
      (+) DAL_HASH_ContextRestoring()

    [..]
    This subsection provides functions allowing to suspend the HASH processing
      (+) when input are fed to the Peripheral by software
          (++) DAL_HASH_SwFeed_ProcessSuspend()
      (+) when input are fed to the Peripheral by DMA
          (++) DAL_HASH_DMAFeed_ProcessSuspend()



@endverbatim
  * @{
  */

/**
  * @brief  Return the HASH handle state.
  * @note   The API yields the current state of the handle (BUSY, READY,...).
  * @param  hhash HASH handle.
  * @retval DAL HASH state
  */
DAL_HASH_StateTypeDef DAL_HASH_GetState(HASH_HandleTypeDef *hhash)
{
  return hhash->State;
}


/**
  * @brief Return the HASH DAL status.
  * @note  The API yields the DAL status of the handle: it is the result of the
  *        latest HASH processing and allows to report any issue (e.g. DAL_TIMEOUT).
  * @param  hhash HASH handle.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_HASH_GetStatus(HASH_HandleTypeDef *hhash)
{
  return hhash->Status;
}

/**
  * @brief  Save the HASH context in case of processing suspension.
  * @param  hhash HASH handle.
  * @param  pMemBuffer pointer to the memory buffer where the HASH context
  *         is saved.
  * @note   The INT, START, CTRL then all the CTSWAP registers are saved
  *         in that order. Only the r/w bits are read to be restored later on.
  * @note   By default, all the context swap registers (there are
  *         HASH_NUMBER_OF_CTSWAP_REGISTERS of those) are saved.
  * @note   pMemBuffer points to a buffer allocated by the user. The buffer size
  *         must be at least (HASH_NUMBER_OF_CTSWAP_REGISTERS + 3) * 4 uint8 long.
  * @retval None
  */
void DAL_HASH_ContextSaving(HASH_HandleTypeDef *hhash, uint8_t *pMemBuffer)
{
  uint32_t mem_ptr = (uint32_t)pMemBuffer;
  uint32_t csr_ptr = (uint32_t)HASH->CTSWAP;
  uint32_t i;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhash);

  /* Save INT register content */
  *(uint32_t *)(mem_ptr) = READ_BIT(HASH->INT, HASH_IT_DINI | HASH_IT_DCI);
  mem_ptr += 4U;
  /* Save START register content */
  *(uint32_t *)(mem_ptr) = READ_BIT(HASH->START, HASH_START_LWNUM);
  mem_ptr += 4U;
  /* Save CTRL register content */
#if defined(HASH_CTRL_MDMAT)
  *(uint32_t *)(mem_ptr) = READ_BIT(HASH->CTRL, HASH_CTRL_DMAEN | HASH_CTRL_DTYPE | HASH_CTRL_MODESEL | HASH_CTRL_ALGSEL |
                                    HASH_CTRL_LKEYSEL | HASH_CTRL_MDMAT);
#else
  *(uint32_t *)(mem_ptr) = READ_BIT(HASH->CTRL, HASH_CTRL_DMAEN | HASH_CTRL_DTYPE | HASH_CTRL_MODESEL | HASH_CTRL_ALGSEL |
                                    HASH_CTRL_LKEYSEL);
#endif /* HASH_CTRL_MDMAT*/
  mem_ptr += 4U;
  /* By default, save all CTSWAPs registers */
  for (i = HASH_NUMBER_OF_CTSWAP_REGISTERS; i > 0U; i--)
  {
    *(uint32_t *)(mem_ptr) = *(uint32_t *)(csr_ptr);
    mem_ptr += 4U;
    csr_ptr += 4U;
  }
}


/**
  * @brief  Restore the HASH context in case of processing resumption.
  * @param  hhash HASH handle.
  * @param  pMemBuffer pointer to the memory buffer where the HASH context
  *         is stored.
  * @note   The INT, START, CTRL then all the CTSWAP registers are restored
  *         in that order. Only the r/w bits are restored.
  * @note   By default, all the context swap registers (HASH_NUMBER_OF_CTSWAP_REGISTERS
  *         of those) are restored (all of them have been saved by default
  *         beforehand).
  * @retval None
  */
void DAL_HASH_ContextRestoring(HASH_HandleTypeDef *hhash, uint8_t *pMemBuffer)
{
  uint32_t mem_ptr = (uint32_t)pMemBuffer;
  uint32_t csr_ptr = (uint32_t)HASH->CTSWAP;
  uint32_t i;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hhash);

  /* Restore INT register content */
  WRITE_REG(HASH->INT, (*(uint32_t *)(mem_ptr)));
  mem_ptr += 4U;
  /* Restore START register content */
  WRITE_REG(HASH->START, (*(uint32_t *)(mem_ptr)));
  mem_ptr += 4U;
  /* Restore CTRL register content */
  WRITE_REG(HASH->CTRL, (*(uint32_t *)(mem_ptr)));
  mem_ptr += 4U;

  /* Reset the HASH processor before restoring the Context
  Swap Registers (CTSWAP) */
  __DAL_HASH_INIT();

  /* By default, restore all CTSWAP registers */
  for (i = HASH_NUMBER_OF_CTSWAP_REGISTERS; i > 0U; i--)
  {
    WRITE_REG((*(uint32_t *)(csr_ptr)), (*(uint32_t *)(mem_ptr)));
    mem_ptr += 4U;
    csr_ptr += 4U;
  }
}


/**
  * @brief  Initiate HASH processing suspension when in polling or interruption mode.
  * @param  hhash HASH handle.
  * @note   Set the handle field SuspendRequest to the appropriate value so that
  *         the on-going HASH processing is suspended as soon as the required
  *         conditions are met. Note that the actual suspension is carried out
  *         by the functions HASH_WriteData() in polling mode and HASH_IT() in
  *         interruption mode.
  * @retval None
  */
void DAL_HASH_SwFeed_ProcessSuspend(HASH_HandleTypeDef *hhash)
{
  /* Set Handle Suspend Request field */
  hhash->SuspendRequest = DAL_HASH_SUSPEND;
}

/**
  * @brief  Suspend the HASH processing when in DMA mode.
  * @param  hhash HASH handle.
  * @note   When suspension attempt occurs at the very end of a DMA transfer and
  *         all the data have already been entered in the Peripheral, hhash->State is
  *         set to DAL_HASH_STATE_READY and the API returns DAL_ERROR. It is
  *         recommended to wrap-up the processing in reading the digest as usual.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_HASH_DMAFeed_ProcessSuspend(HASH_HandleTypeDef *hhash)
{
  uint32_t tmp_remaining_DMATransferSize_inWords;
  uint32_t tmp_initial_DMATransferSize_inWords;
  uint32_t tmp_words_already_pushed;

  if (hhash->State == DAL_HASH_STATE_READY)
  {
    return DAL_ERROR;
  }
  else
  {

    /* Make sure there is enough time to suspend the processing */
    tmp_remaining_DMATransferSize_inWords = ((DMA_Stream_TypeDef *)hhash->hdmain->Instance)->NDATA;

    if (tmp_remaining_DMATransferSize_inWords <= HASH_DMA_SUSPENSION_WORDS_LIMIT)
    {
      /* No suspension attempted since almost to the end of the transferred data. */
      /* Best option for user code is to wrap up low priority message hashing     */
      return DAL_ERROR;
    }

    /* Wait for BUSY flag to be reset */
    if (HASH_WaitOnFlagUntilTimeout(hhash, HASH_FLAG_BUSY, SET, HASH_TIMEOUTVALUE) != DAL_OK)
    {
      return DAL_TIMEOUT;
    }

    if (__DAL_HASH_GET_FLAG(HASH_FLAG_DCIS) != RESET)
    {
      return DAL_ERROR;
    }

